app/controllers/articles_controller.rb

  def create
    @article = Article.new(article_params)
    @article.save
---
INSERT INTO "articles" ("game_name", "image_id", "review", "machine", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def index
    @articles = Article.page(params[:page]).per(10)
---
SELECT  "articles".* FROM "articles" LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]