app/controllers/members_controller.rb

  def show
    @user = User.find(params[:id])
    @articles = Article.where(user_id: @user.id).page(params[:page]).per(5)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "articles".* FROM "articles" WHERE "articles"."user_id" = ? LIMIT ? OFFSET ?  [["user_id", 1], ["LIMIT", 5], ["OFFSET", 0]]